
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрСообщение = Неопределено;
	Если Параметры.Свойство("Сообщение", ПараметрСообщение) Тогда		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрСообщение, , "Текст");		
		Текст = HTMLТекст(ПараметрСообщение.Текст); 
	Иначе
		Сообщить(НСтр("ru = 'Отсутствует сообщение для отображения'"));
		Возврат;
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(ЭтаФорма)
	
	ЭтаФорма.Элементы.Период.Видимость = ЗначениеЗаполнено(ЭтаФорма.Период);
	
КонецПроцедуры

&НаСервере
Функция HTMLТекст(Содержимое)
		
	Если СтрНачинаетсяС(НРег(Содержимое), "<html") Тогда
		Возврат Содержимое;
	Иначе
		Возврат СтрШаблон( 
			"<html>
			|<body>
			|	%1
			|</body>
			|</html>", 
				Содержимое);
	КонецЕсли;		
	
КонецФункции

#КонецОбласти