
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Компонента", Компонента) Тогда
		ЭтаФорма.Заголовок = СтрШаблон(
			НСтр("ru = 'Просмотр логов (%1)'"),
				Компонента);
		
		Параметры.Свойство("ИмяФайла", ЛогИмяФайла);
	КонецЕсли;
	
	ПолучитьЛогиКомпоненты();	
	
	ГруппироватьСообщения = Истина;
	
	НачалоПериода = НачалоДня(ТекущаяДатаСеанса());
	КонецПериода = КонецДня(ТекущаяДатаСеанса()) + 1;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Получить(Команда)
	
	Если ЗначениеЗаполнено(ЛогИмяФайла) Тогда
		ПолучитьСообщения(ЛогИмяФайла);
	Иначе
		ТекущиеДанные = Элементы.Логи.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПолучитьСообщения(ТекущиеДанные.ИмяФайла);		
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Для получения сообщений необходимо выбрать Компоненту и Лог'"));		
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомпонентаПриИзменении(Элемент)
	
	ПолучитьЛогиКомпоненты();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);	
	
	СформироватьПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияОтображениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СообщенияОтображение.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда	
		ЛоггерКлиент.ПоказатьСообщение(
			ТекущиеДанные.Период,
			ТекущиеДанные.Уровень,
			ТекущиеДанные.Объект,
			ТекущиеДанные.Текст
		);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьЛогиКомпоненты()
	
	Логи.Параметры.УстановитьЗначениеПараметра("Ссылка", Компонента);
	
	Элементы.Логи.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(ЭтаФорма)
	
	Элементы = ЭтаФорма.Элементы;
	
	Элементы.СообщенияОтображениеКоличество.Видимость = ЭтаФорма.ГруппироватьСообщения;
	Элементы.СообщенияОтображениеПериод.Видимость = Не ЭтаФорма.ГруппироватьСообщения;
	
	Элементы.ГруппаЛоги.Видимость = Не ЗначениеЗаполнено(ЭтаФорма.ЛогИмяФайла);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщения(ИмяФайла)
	
	Сообщения.Очистить();	
	СообщенияЛога = Компоненты.Сообщения(Компонента, ИмяФайла, НачалоПериода, КонецПериода);	
	Для Каждого ЭлементКоллекции Из СообщенияЛога Цикл
		НоваяСтрока = Сообщения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции);
		НоваяСтрока.Количество = 1;		
	КонецЦикла;
	
	СформироватьПредставление();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьПредставление()
	
	СообщенияОтображение.Очистить();
	
		// Представление
	Если ГруппироватьСообщения Тогда
		Свертываемая = Новый ТаблицаЗначений();
		Свертываемая.Колонки.Добавить("Объект", Новый ОписаниеТипов("Строка"));
		Свертываемая.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Строка"));
		Свертываемая.Колонки.Добавить("Текст", Новый ОписаниеТипов("Строка"));
		Свертываемая.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		Для Каждого ЭлементКоллекции Из Сообщения Цикл
			ЗаполнитьЗначенияСвойств(Свертываемая.Добавить(), ЭлементКоллекции);
		КонецЦикла;		
		Свертываемая.Свернуть("Объект, Уровень, Текст", "Количество");
		
		Для Каждого ЭлементКоллекции Из Свертываемая Цикл
			ЗаполнитьЗначенияСвойств(СообщенияОтображение.Добавить(), ЭлементКоллекции);
		КонецЦикла;
	Иначе		
		Для Каждого ЭлементКоллекции Из Сообщения Цикл
			ЗаполнитьЗначенияСвойств(СообщенияОтображение.Добавить(), ЭлементКоллекции);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти