
///////////////////////////////////////////////////////////////////////////////
// API (Info)

#Область API_Info

Функция КомпонентаДоступна(Компонента) Экспорт

	Возврат Компоненты.КомпонентаДоступна(Компонента);
	
КонецФункции

Функция ВерсияКомпоненты(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Возврат Компоненты.ВерсияКомпоненты(Компонента, ОписаниеОшибки);
	
КонецФункции

// Прикладное

Функция ЛогиКомпоненты(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Возврат Компоненты.ЛогиКомпоненты(Компонента, ОписаниеОшибки);
	
КонецФункции

#КонецОбласти
