
///////////////////////////////////////////////////////////////////////////////
// API (Info)

#Область API_Info

Функция КомпонентаДоступна(Компонента) Экспорт

	Возврат Компоненты.КомпонентаДоступна(Компонента);
	
КонецФункции

Функция ВерсияКомпоненты(Компонента) Экспорт
	
	Возврат Компоненты.ВерсияКомпоненты(Компонента);
	
КонецФункции

// Прикладное

Функция ЛогиКомпоненты(Компонента) Экспорт
	
	Возврат Компоненты.ЛогиКомпоненты(Компонента);
	
КонецФункции

Функция УдалитьВсеСообщения(Компонента, Лог) Экспорт
	
	Возврат Компоненты.ОчиститьВсеСообщения(Компонента, Лог);
	
КонецФункции

#КонецОбласти
