
///////////////////////////////////////////////////////////////////////////////
// API (Info)

#Область API_Info

Функция ПроксиКомпоненты(Компонента, ОписаниеОшибки = Неопределено, ПопыткаПодключения = 1) Экспорт
	
	Прокси = Неопределено;	
	Попытка
		АдресWSDL =                                            
			"http://" + Компонента.Хост + ":" + Формат(Компонента.Порт, "ЧГ=0") + "/Info?wsdl";		
		Определение = Новый WSОпределения(АдресWSDL);	
		Прокси = Новый WSПрокси(Определение, "http://info.ak.ru/", "Info", "InfoPort");
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
			
	Возврат Прокси;
	
КонецФункции

Функция КомпонентаДоступна(Компонента) Экспорт
			
	Возврат ПроксиКомпоненты(Компонента) <> Неопределено;
	
КонецФункции

Функция ВерсияКомпоненты(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Версия = НСтр("ru = 'API компоненты не доступно.'");;	
	
	Прокси = ПроксиКомпоненты(Компонента, ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда		
		Версия = Прокси.version();	
	КонецЕсли;			
	
	Возврат Версия;
		
КонецФункции

// Прикладное

Функция ЛогиКомпоненты(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	Прокси = ПроксиКомпоненты(Компонента, ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		// todo: метод без параметров, но 1С упорно его видит
		Параметры = Прокси.ФабрикаXDTO.Создать("http://info.ak.ru/", "logs");
		ЛогиXDTO =  Прокси.logs(Параметры);
		Для Каждого ЛогXDTO Из ЛогиXDTO.return Цикл
			Результат.Добавить(ЛогXDTO);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция Сообщения(Компонента, Лог, НачалоПериода, КонецПериода, ОписаниеОшибки = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	Прокси = ПроксиКомпоненты(Компонента, ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		ПараметрыXDTO = Прокси.ФабрикаXDTO.Создать("http://info.ak.ru/", "messagesByPeriod");		
		ПараметрыXDTO.connection = Прокси.ФабрикаXDTO.Создать("http://info.ak.ru/", "sqliteConnection");
		ПараметрыXDTO.connection.fileName = Лог;		
		ПараметрыXDTO.from = НачалоПериода;
		ПараметрыXDTO.to   = КонецПериода;
				
		СообщенияXDTO = Прокси.messagesByPeriod(ПараметрыXDTO);
		Для Каждого СообщениеXDTO Из СообщенияXDTO.return Цикл
			Запись = Новый Структура("Период, Объект, Уровень, Текст");
			Запись.Период  = СообщениеXDTO.period;
			Запись.Объект  = СообщениеXDTO.objectLog.name;
			Запись.Уровень = СообщениеXDTO.level.name;
			Запись.Текст   = СообщениеXDTO.text;
			
			Результат.Добавить(Запись);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти