
// Функция возвращает список активных (включенных) компонент
// 
// Возвращаемое значение:
//  Массив - 
//
Функция АктивныеКомпоненты() Экспорт
	
	Результат = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Компоненты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Компоненты КАК Компоненты
		|ГДЕ
		|	Компоненты.Использование";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции